Tools/src/Catalogs/ОИМЦ_63_Склады/ОИМЦ_63_Склады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОИМЦ_63_Склады</name>
  <owners>Catalog.ОИМЦ_63_Организации</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.ОИМЦ_63_Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтореИд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Tools/src/Catalogs/ОИМЦ_63_Склады/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЭтотОбъект.Список.Отбор.Элементы.Количество() = 0 Тогда
		Элементы.Заполнить.Видимость = Ложь;
		Элементы.ОтборОрганизация.Видимость = Истина;
	Иначе
		Элементы.Заполнить.Видимость = Истина;
		Элементы.ОтборОрганизация.Видимость = Ложь;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	ТЗ = ОИМЦ_Данные.ЗапросДанных63("select distinct m.""storeID"", coalesce(d.description, 'Отделение') as descript " + 
									"from ""movementDrug"".movement m left join documents.doc d on d.id = m.""storeID"" " +
									"where ""orgID"" = " + Формат(ЭтотОбъект.Список.Отбор.Элементы[0].ПравоеЗначение.ОргИд, "ЧГ=0") + 
									" order by descript;");
	Если ТЗ <> Неопределено Тогда
		УстановитьПривилегированныйРежим(Истина);
		Для каждого Элемент Из ТЗ Цикл
			Наименование = СокрЛП(Элемент.descript) + "_" + Формат(Элемент.storeID, "ЧГ=0");
			Поиск = Справочники.ОИМЦ_63_Склады.НайтиПоНаименованию(Наименование, Истина, , ЭтотОбъект.Список.Отбор.Элементы[0].ПравоеЗначение.Ссылка);
			Если Поиск.Пустая() Тогда
				НО = Справочники.ОИМЦ_63_Склады.СоздатьЭлемент();				
				НО.Наименование = Наименование; 
				НО.Владелец = ЭтотОбъект.Список.Отбор.Элементы[0].ПравоеЗначение.Ссылка;
				НО.Организация = ЭтотОбъект.Список.Отбор.Элементы[0].ПравоеЗначение.Ссылка;
				НО.Склад = Наименование;
				НО.СтореИд = Элемент.storeID;			
				НО.Записать();	
			Иначе
				СО = Поиск.ПолучитьОбъект();							
				СО.Склад = Наименование;
				СО.СтореИд = Элемент.storeID;			
				СО.Записать();	
			КонецЕсли; 			
		КонецЦикла; 
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Организация", Организация,,, ЗначениеЗаполнено(Организация));
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияОчистка(Элемент, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Организация) Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры
